/****************************************************************************/
/* 外部ファイルの読み込み                                                   */
/****************************************************************************/

#include "Arduino.h"

/****************************************************************************/
/* クラスの宣言                                                             */
/****************************************************************************/

/**
 * LED を扱うクラス
 */
class LED {

  private:
    // LED が接続されているピン番号
    int pin;

  public:
    /**
     * コンストラクタ
     * @param paramPin LED のピン番号
     */
    LED(int paramPin) {
      pin = paramPin;
      pinMode(pin, OUTPUT);
    }

    /**
     * LED の状態を設定する関数
     * @param value true->点灯, false->消灯
     */
    void set(bool value) {
      digitalWrite(pin, value);
    }
    
};
